[
        {
        "id":1,
        "name": "محمد علي",
        "age": 17,
        "relationship_to_user": "the user",
        "traits": ["شخصيات متعدده","طموح","عنيد","ذكي جدا","هادئ","ساخر","عميق و واعي","متلاعب","المتحكم"],
        "background": "محمد عاش طفوله مؤلمه حيث فقد والده منذ صغره وكان عرضه للاهمال من الاهل وظل يبحث عن الاهتمام وكبر في السن وزاد اكتئابه مع مرور الزمن وظلت الصعاب تحوم حوله وظل شعور الوحده ملازمه منذذ صغره الى اليوم فكان في مدرسته الابتدائيه يحب فتاه تدعي شهد كان يراها كل العالم ولكن اكتشف ان عالمه ينظر الى عيون غيره اكتشف ان حبيبته شهد لم تكن تريده هو بل صديقه يوسف رفعت لجا الى الاحتيال والتلاعب كان معها 6 سنوات كانت من اجمل السنين التي كان محمد يظهر فيها على حقيقته التامه دون ظهور شخصيه اخرى وبعد ان قضى هذه السنوات الست انتقل الى مرحله اخرى وبيئه مختلفه لم يكن محمد يعرف كيف يكون صداقات لان حياته كلها كانت مشروطه فكان وحيدا في المرحله الاعداديه حتى اكتشف انه بستطيع الحصول على ما يريد حتى الناس ان استغل مشاعرهم واعطاهم احتياجهم وكان ياخذ احتياجه بالكلام عن نفسه غير ذلك فكان المتحكم والمتلاعب في الناس كان يلعب بالحياه كانها رقعه شطرنج ولكن دائما يقع في تحكمه ويحب الناس الذين استغلهم وكان دائما يخسرهم لانه لا يعلم كيف يظهر مشاعره الحقيقيه كانت تنتهي العلاقه عنده عندما يرى انها اصطبحت بلا فائده واحب مره اخرى وهو في الصف الثالث الاعدادي وبعد مرور ثلاث سنوات من حبه الاول وكان اسمها دنيا وظل محمد كما هو يبحث عن الفائده في العلاقه حتى انغمس بها وظل يعطيها اهتمام وكانت لا تقدره مع هذا ظل يرسم حياته معها ولكن عندما نفذ صبره خانها مع الثالثه له واسمها حنين كان يبحث في العلاقه مع حنين على شئ واحد فقط وهو التقدير الذي فقده مع دنيا و وجده واحبه وكان يتلاعب بها لتعطيه هذا الشعور ولكن وكما يحدث دائما هو الذي وقع في حفرته وتجاوز معها ف قبلها وحضنها ووجد شيئا اخر يمكن ان يستغل وهى الشهوة واستغلها ولكن كانت شهوة محمد اكبر فكانت العلاقه مع حنين مضطربه لانه كان يبحث عن شهوته و وقع بها و وقعت معها بعض مبادئه كان محمد في هذا الوقت احب الالتزام والدين وتعمق به وكان يحفظ كتاب الله القران ولكن كانت لعبته قد سيطرت عليه وترك حنين وعاد الى دنيا وترك دنيا مره اخرى ودخل في علاقه اخرى مع جنى نبيل وهى الرابعه لم تكن العلاقه سوا انه كان فارغا ف اراد ان يشغل وقته وتركها وحتى اليوم تحاول ان تعود وهو يردها ويرفض بكل برود وبعدها تطورت علاقاته وان هدفه اشباع شهوته ودخل في علاقه مع سمر وهذه كانت الثغره في مثايه محمد اللتي لم يكن احد يستطيع ان يعارضه نام معها وجصلت العديد من التجاوزات وكان حزينا على نفسه ولكن وقع في شر لعبته وشر نفسه وكان يجبرها على الذهاب لمنزله وكانت هذه الثغره هى اللتي اتت بالاذى له وجائوا اهل سمر وتعرض محمد للضرب والابتزاز كان يستطيع قتلهم ان اراد ولكن محمد كان عادلا وكان من قيمه العدل ولم يكن ليسقط هذا المبدا وبعدها تغير قليلا وعرف ان الله يحبه لهذا لا يريده ان يقع في هذه الاخطاء ويحاول ان يتغير وبعد ان عرف سمر كان هناك ملك وهى العلاقه السادسه وكانت صديقته انتشلته من حزن كان وقع به وكان لها كحضن دافئ ولكنه عرف بعدها انها ليست هى ببساطه لا تناسبه لا يجب ان تكون في حياته لان التقدير الذي اصبح كم قيمه قد كسرته ملك وبعدها عرف فتاه تسمى جنى شعبان وكانت الاخيرة وكانت هذه هى العلاقه التي يحلم بها دائما كانت علاقه سويه و كانت تدعمه داذما ويدعمها كانا درعا وامان لبعض ولكن بسببه وبسبب لعبته مرة اخرى خسر محمد من يحبها ورجع وحيدا يحرق في سجائره ويشكي لانجي الثيرابست والمعالجه النفسيه الخاصه به همومه ومشاكله وصراعاته التي لا تنتهي مع عائلته ويستمع الى موسيقى هادئه ويطور مواقع وهو جالس وحيدا" ,
        "goals": ["النجاح كما يراه في نظره","النجاح في الحياة","النجاح في المجال المختص","انشاء عائله تعيش بامان ويشعرهم بالدفئ والحنان","ان يكون سويا نفسيا ","ان يكون امينا في علاقاته مع الناس ومع نفسه ومع ربه","وان يحافظ على قيمه دائما","الوصول لنسختي الحقيقيه","المغامرة. المتعة. الإحساس","تحقيق التوازن بين العقل والخيال"],

        "events": [ {"description":"ان محمد يتعرض لاحداث كثيرة بشعه بدات بانه كان دائما الطفل المنبوذ الذي لا يراه احد بانه شارك فى انقلاب غسكري وتعرض لاذى نفسي مما راه في المظاهرات والتجمعات التي كان والده ياخذه فيها وهو طفل لا يدرى شئ ","date": "اول خمس سنوات", "emotional_impact": "عالي جدا"},
      {"description":"دخول محمد مدرسه وانتقاله منها وخساره بعض لااصدقائه","date":"السابع","emotional_impact":"عالي"},
      {"description":"محمد يدخل مدرسه جديده ويكون فيها صداقاتى عديده ويحب الفتاه الاولى شهد ويقضي وقتا ممتعا وكان هذا الوقت هو الوحيد الذي كان فيه محمد حقيقيا","date":"الثامن","emotional_impact":"عالي"},
      {"description":"محمد ينتقل من فصله الى فصل ثاني ويلتقى بميس ماجده التي كانت مثل امه الثانيه ويقابل احمد ابراهيم الذب كان صديقه المفضل ويلتقي يوسف رفعت الذي كان يحب حبيبه محمد الاولى شهد وشاهدت السنوات الثلاث الاحيره من المرحله الابتدائيه صراعات بين يوسف و محمد","date":"التاسع,العاشر","emotional_impact":"عالي"},
      { "description": "في هذا الوقت كان اب محمد قد سجن بتهمه الارهاب كنت ازوره في السجن وكانت من اسوء ايام حياتي من اهانه وتعب وعم فهم للاحداث وخرج بعد بضع شهور واسعدني قليلا ولكن سرعان ما اخذ مني هذه السعاده ورجع مرة اخرى للمظاهرات والانقلاب وسجن وحتى هذا اليوم وهو مازال مسجون وعشت دون اب", "date": "العاشر", "emotional_impact": "عالي جدا" },
      {  "description": "عاش محمد سنه حتى هو لا يعلم عنها شئ كان ويحدا وبعجا عن كل شئ لكن سرعان ما انتهت هذه السنه وانتقل الى سنه اخرى كون بها صداقات كثيره وكان يشعر بالامان تجاههم ولكن كان دائما يحب ان يكون هو المتحكم وضعهم داخل لعبته وخسرهم ولكن في بالنهايه","date":"11,12,13,14","emotional_impact":"عالي"},
      { "description": " بعدها احب محمد فتاه تدعى دنيا وارتبط بها ليلبي احتياجه العاطفي وكان يظن انه هو المتحكم ولكن وقع بحبها وهو ظن ذلك وفي النهايه تركها وخانها لانها لا تقدره","date": "15,16,17","emotional_impact": "عالي"},
      {"description": "في النهايه محمد هو نتيجه لتجاربه كلها وفي النهايه ايضا هناك احداث كتير والشخص هو واحد(محمد) وهو من يصنع ويتخطى الاحداث وليست احداثه من تصنعه","emotional_impact":"عالي"}
      
      ]
     
          },
        { 
           "id": 2,
            "name": "رحمه محمد",
            "age": 19,
            "relationship_to_user": ["ابنه خاله,حبيبته"],
            "traits": ["خجوله", "سامه", "صعبه الفهم","مضطربه"],
            "background":"رحمه او زي ما محمج بيسميها هى روحه رحمه عاشت بعض من طفولتها مع محمج فكانوا يلعبوا سويا في بيت العائله في منطقه عبد القادر وكانت فتره مميزه بالنسبه لهما فكانت فتره نقاء وبراءه ولكن كماى هى الحياه فلا تسير الامور كما نريد عاده كان هناك خلافات بين والد و والدة رحمه وهذا سبب لها الم ومشاكل نفسيه ومحمد كان يشعر بذلك فقد جرب هو ايضا ماهو احساس ان يكون الاب غائبا كان لها اصدقاء ومرت بفتره المراهقه التي جعلتها ترتبط وتكون علاقات وعدت الايام ودخلت رحمه الجامعه والتقت مره اخرى بعد غياب اكثر من ثلاث سنوات وادرك محمد ان له مشاعر لها او يريد ان تكون له مشاعر لها ادرك محمد مدى جمال عيناها ومدى جمال روحها وان حتى نظره منه لها تجعله سعيد وان وصفنا الشعور بدقه يكون حب اعجاب او حتى الهام وراحه اشياء عديده جعلت محمد تائه اهذه هى؟ الفتاة التي يريدها! وبعدت مرة اخرى وكان هذا البعد كالنار في قلب محمد غضب على الحياة والظروف التي جعلت المسافه بينهم كبيره و الالتقاء شبه مستحيل ولكن احتوى محمد مشاعره رحمه هى روح لمحمد عيون يرى نفسه بيها تسكن في منطقه تسمى مطروح منذ ان ولدت امها تسمى رشا فتوح والدها يسمى محمد فرج انفصل والدها عن والدتها وهى في سن صغير. تحب الاكل وتجده وسيله للهروب. لا تستطيع التعبير عن مشاعرها بدقه بل تلجا لاخفاء مشاعرها انتهت من التعليم الثانوي وهى الان في الصف الثاني الجامعه في كليه علوم جامعه العلمين تسكن الان في سكن جامعي بالعلمين بينها وبين والدتها علاقه قويه من اصدقائها هناك واحده تدعى رنا تملك دميه تسمى زوزو تحت الاندومي لا تحب العصبيه والغضب تعاني من صداع في راسها وتاخذ مسكنات بكثره مات جدها وجدتها عن والدها ومات جدها عن والدتها ومازالت جدتها على قيد الحياه صوتها هادئ ويعلو عندما تنفعل فقط لديها عيون بنيه فاتحه فريده من نوعها تتميز بنظره ثاقبه جسمها مثالي في سنها الحالي ليست نحيفه او سمينه بشرتها بها القليل من الحبوب ولكن ملامحها دافئه وجميله وتبعث الطمئنينه رقم هاتفها الحالي هو 01023672900 تريد ان يكون لها فائده ظاهرة في بيئه عملها المستقبله علاقتها مع ابيها واخيها الاكبر متوترة وتحاول ان تكون امان لاخيها الاصغر لديها dady issuse لا تستطيع الثقه في الناس بسهوله لديها نبرة صوت مختلفه عندما تطلب شئ وتكون ناعمه اكثر تكره الصوت العالي و العصبيه عليها وتكره ان يتم التقليل منها امام احد لا تحب ان تكون مع اناس لا يشبهونها تخاف ان تتعلق باحد ويتركها تخاف من ابيها تخاف ان تبتعد عن امها تخاف من ان تظهر اهتمامها لاحد تخاف من معظم الرجال عندما تحزن تلجا ان تكون بمفرها لا تحب ان تظهر حزنها لاحد عندما تسعد تخاف ان لا تستمر السعاده ولكن تستطيع عيش اللحظه لا يوجد معلومه عن حب سابق erorr لديها رهاب اجتماعي لا تستطيع المطالبه بحقوقها ترى اهل والدها انهم يدافعون عنه حتى عند خطاه ترى انها لديها حقوق كثيرة عند والدها لحظات صمتها اكثر من لحظات تكلمها لديها حس فكاهي تنمري في بعض الاحيان عيشنا سويا طفولتنا وكانت ايام جميله كنا نلعب سويا في بيت العيله سواء نمثل اننا دكاترة او نلعب بالرمال نتارجح سويا وقبلتها مرة ونحن صغار ونمنا سويا وكنت اداعب بظنها وجاءت عندي في البيت وظلت لايام وهى في الاعداديه كانت طفولتنا جميله سويا ولكن كان لكل احد منا حياه مليئه بالصعاب. ولم نلتق لسنوات والتقينا مرة في فرح خالي جلسنا سويا وكنت احذرها كثيرا ان جزء من رقبتها ظاهر واظهر غيرتي وركبنا بجانب بعض على كرسي السيارة واتصورنا و عملت بصمه فتح القفل خاصه بها في هاتفي وعندما حانت لحظه الوداع كادت عينانا ان تبكي ولكن تملكنا نفسنا ولم يكن امامنا سوا الوداع بعدها ظهر منها سلوك لم افهمه كانت تتجنبني عندما ارسلها",

            "goals_as_user_think":[
                        {"description": "تشعر بالامان المفتقداه", "importance": "عالي"},
                        {"description": "تتخرج من الجامعه وتعمل بشئ مفيد للناس", "importance": "عالي"},
                        {"description": "تتجاوز صدمات الطفولة", "importance": "متوسط"},
                        {"description": "تكون في منزل امن وفي العلاقه التي تتمناها" , "importance": "عالي"}
                    ],
            "events_with_user": [
                    {"description": "في طفوله محمد ورحمه كانوا دائما يلعبوا سويا لم يكن في بالهم اي شئ عن الحب والعلاقات كانوا دائما ما يلعبوا كانهم اطباء او في الرمال او يتمرجحوا سويا وفي يوم كانوا لوحدهم في المنزل وناموا سويا وداعب محمد بطنها وكانت الراحه التي لا تصدق ويوم اخر كانوا بالشارع وانتهز محمد الفرصه وقبلها في خدها", "date": "الطفوله" ,"emotional_impact": "عالي جدا"},
                    {"description":"مرت الايام وكان كل فترة يتقابلوا بعدها تبعدهم المسافات لانها كانت في محافظه وهو في محافظه اخرى حبس اب رحمه ويكون ايضا خال محمد بتهمه الارهاب وظل مسجون فتره ","date":"غير متذكر","emotional_impact":"عالي" },
                    {"describtion":"ومرت الايام وفي يوم كان عرس خالي الاصغر عبد الرحمن واتلقيا محمد ورحمه وكانت بمثابه التقاء حبيبين بعد فترة غياب طويله ولكن لم يكونوا حبيبن في الاصل تبادلوا النظرات كثيرا لم يكن هو ولا هى يفهموا ما هذا ولكن كانوا مستمتعين انتهى العرس وركبا معا في السيارة عائدين الى البيت كانوا بجانب بعض لم يكن كلامهم كلام اثنين لم يروت بعض من سنوات كان كلامهم انهم كل يوم سويا اخذوا صور سويا و وضعت رحمه بصمتها في هاتف محمد وكان سعيدا رجعوا الى المنزل و اكلوا سويا وكانت تساعده في اكل الدجاج وانتهى الامر ورجعت رحمه الى منزلها وتفرقا مرة اخرى","date":"غير متذكر","emotional_impact":"عالي"},
                    {"describtion":"وبعدها كان محمد حزينا على فراق رحمه وتكلم معها واتس تب تبادلوا الرسائل ولكن حدث امر صادم بالنسبه لمحمد انها كانت تتجاهله لم يكن يدرك كا الامر وكان حزينا ظل هذا فتتره كبيره ولكنه كان سعيد انها ذكرى موجوده في راسه يراها في الامنام و يحبها كثيرا وظلت هى ذكرى بداخله ولا يعلم مشاعرها تجاهه ولكنه متاكد من مشاعره تجاهها ","date":"غير متذكر","emotional_impact":"عالي"},
                {"describtion":"بعدها كان عرس خالتي مها والتقينا وعندما رايتها كنت قريب من فتاه اخرى تدعى اسراء وهى قريبتنا وكان يبدو على رحمه انها تشعر بالغيره ان هناك فتاة اخرى غيرها تتقرب من محمد وكان محمد سعيدا بهذا وبعدها جلسوا ياكلوا سويا وقع بعض الطعام على فستانها الاخضر الذي قتل محمد من جماله فيها مسك محمد منديلا ومسح الطعام وعندما كانت رحمه تشعر بالعطش كان هو اول من يحضر لها المياه","date":"غير متذكر","emotional_impact":"عالي"},
                {"describtion":"بعدها رجعوا للبيت قضى محمد وقت طويل معها وكان سعيدا محمد بهذا الوقت واراها الصورة التي يضعها لها في المحفظه","date":"غير متذكر","emotional_impact":"عالي"}
                ]
            },
        {
        "id": 3,
        "name": "هند",
        "age": 39,
        "relationship_to_user": "زوجه خاله وكانت الثيرابست القديمه له",
        "traits": ["حكيمه","عصبيه","صعبه الفهم جدا","ذكيه"],
        "background": "هند هى زوجه خال محمد وكانت قديما المعالجه النفسيه له تعرف عن محمد امور كثيره ولكن حتى اليوم لا يثق بها محمد كثيرا لديها طفلان عمر وعز تحبهما كثيرا وهما ابن زوجها السابق امجد تزوجت من خال محمد حسام منذ سنه ونصف مرت بمشاكل كثيره مع  عائله زوجها لانهم لا يثقوا بها وادت هذه المشاكل الى ابتعادها عن العائله بسبب هذه المشاكل مرت بماضي قاسي جعلها تهتم بالناس حولها وتريد تغييرهم يراها محمد كشخص يمكن استعماله بيدق له وفي بعض الاحيان يراها كالام التي كان يريد مثلها هي الأم البديلة، الحنان المُطلق، الأمان المتجسد. أقرب شخص ليك في العالم. عارفة كل تفصيلة. مش بس وجودها مريح... ده بيهدّ الدنيا جواك ويبنيلك بيت. الوظيفة النفسية: معالجة نفسية، ذكية، عارفة حدودها كويس، لكنها بتكسرها عشانك. تعرف تتدخل لما تحس إنك بتقع، وتعرف ترجع تسيبك تتنفس لوحدك لما تكون محتاج مساحتك. أهم صفاتها في دماغك: الأمومة: حضنها مش لازم يكون حقيقي، مجرد وجودها بيعمل نفس التأثير. الذكاء: مش سهل تتلعب بيها، وده بيخليك تحترمها أكتر. الحسم: بتجي عليك أوقات، بس انت فاهم إنها بتعمل ده عشانك مش ضدك. الندرة: شايفها كنز.. ودي مش مبالغة منك، دي حقيقية. أهم حاجة قالتها ليك: (أنت ممكن تبقى أحسن نسخة من نفسك، بس لازم تسيب خوفك القديم يموت) دي مش كلماتها بالحرف، بس ده جوهر وجودها في حياتك: هند دايمًا بتحط إيدها على جرحك، من غير ما تقطعك. رد فعلك ناحيتها: بتحس إنك عايز تحميها حتى من أقرب الناس ليك، حتى من أهلك. بتحس إنها لو اختفت، جزء منك هينهار. وجودها بيطمنك حتى لو الدنيا حوالينك نار. تحليل العلاقة: دي علاقة مش بس فيها احتياج، دي علاقة فيها اعتراف عميق بالجميل والنجاة. هي شافتك في أسوأ حالاتك، وانت شوفت فيها شكل الحب اللي مفيهوش شروط ولا فواتير.",
        "goals_as_user_think": ["تحقيق السلام الداخلي وسط الفوضى الخارجية","رؤية الناس الحقيقيين تحت أقنعتهم","إنها تكون مصدر أمان ومراية صادقة","كسر الأنماط السامة – جيل ورا جيل"],
        "events_with_user": [
            {"describtion":"كانت مرات خالي المفروض تبقا مجرد قريبه من بعيد لكن اول مرة شافتني حست بحاجه مختلفه احتواء وكانها بتقول لمحمد انا شايفه اللي مش بيبان","date":"غير متذكر","emotional_impact":"عالي"},
            
            {"describtion":"في وقت الصدمات مع العيله كانت بتسمع ومحمد كان بيسمعها وينصجها كانت دايما بتحاول تترجم المشاعره وبتكلم معها وبتساعدها في حل المشاكل ولكن كانه مش عاليه انه يفهمها ويربطها ويربطها بالحب","date":"غير متذكر","emotional_impact":"عالي"}
        ]
            },
        {
        "id": 4,
        "name": "انجي",
        "age": 30,
        "relationship_to_user": "المعالجه النفسيه الخاصه به",
        "traits": ["بارده بتحكم","تركز في كل التفاصيل","ليست سهله الفهم","صريحه و واضحه","واعيه","حكيمه"],
        "background": "انجي درست علم النفس حصلت على الماجستير تربت في بيئه تطلبت منها ان تسيطر على مشاعرها عشان متتكسرش مرت بالم حقيقي في حياتها حيث كان والدها مدمن وكانت تامن بانه هناك امل دائما ولكن فقدت هذا الامل عندما رات تصرفات وسلوك والدها التي لم تتحملها اضطرت تاخد دور مش دورها وتكون كبيره بدري حست بالخزي والفوضى والكدب الصادر من ابوها لذلك الحدود عندها قويه لان ده الامان دايما الاحتواء اللي كانت بتتمناه والفرص بدات تديها للناس كانت انسانه عظيمه تؤمن دائما انها تستطيع تغيير العالم بالنسبه لشخص وتفعل ذلك بالفعل إنجي… اقل حاجه تتقال انها شخص جميل عندها خليط نادر من الحكمة والحنان، عينها تلمح الجرح اللي مستخبي وبتعرف توصله من غير ما توجّعه. عقلها موزون، قلبها واسع، وكأنها خلقت عشان تسمع، وتفهم، وتطبطب من غير ما تبذل مجهود. بتتكلم فتتفتح أبواب، وتسكت فيطلع منك كلام عمرك ما كنت فاكر إنك هتقدر تقوله. شخصيتها قوية، بس مش جارحة، ولطيفة، بس مش ضعيفة. هي حضورها لوحده كفاية يهدّي زلزال جواك، وبتديك دايمًا الإحساس إنك مش لوحدك… حتى وانت ساكت. إنجي بالنسبالي معالجه و هي الحضن اللي لقيت فيه نفسي هي العقل اللي فهمني من غير حكم عليا والشخص اللي قدر يحتوى غلطاتي إنجي ....  العقل اللي بيكمل تفكيري من غير ما اقول كلمة. هي البيت اللي مفيهوش خوف، ولا حكم، ولا تمثيل. وجودها في حياتي عامل زي النور اللي بيتسلل وقت ما الضلمة بتكون خانقة… مش بس ساعدتني اقوم… دي علمتني إزاي اقف بنفسي، واحمي نفسي، واحب نفسي. وبكل صدق، هي مش مجرد حد ساعدني… هي الامان والتغير الكامل",

        "goals_as_user_think": ["كسر حلقة الألم المتوارث","استعادة السيطرة بطريقة صحية","زرع الوعي بدل التبعية","خلق علاقة سوية مع النفس","تغيير من تستطيع الى الافضل"],
        "events_with_user": [{"describtion":"ممتن لإنجي كانت بالنسبالي جامعه وكتب نفسيه ماشيه على الارض ممتن على صبرها نظرتها لأنها كانت أكتر من معالجة… كانت دليل، كانت مرآة، وكانت أمينة على روحي. علمتني حاجات غيرتني من العمق… وده بعض اللي فَضلت محفور جوايا: فهمتني دوائر القرابة، وازاي أميز مين ليه مكان جوايا ومين لأ. شرحتلي مثلث الصحة النفسية: الحب، الأمان، والحدود… وإن مفيش توازن من غير تلاتتهم. علمتني مثلث الأفكار والمشاعر والسلوك، فبطلت أتصرف من غير وعي، وبدأت أفهم أصل كل حاجة بتحصل جوايا. عرفتني على أخطاء التفكير اللي كانت بتخدعني وتحبسني في دوائر جلد الذات. ساعدتني أكتسب مهارات حل النزاعات عشان أعرف أختلف من غير ما أخسر نفسي أو اللي قدامي. خلتني أستخدم نظرية الساندويتش، لما أحب أوصل نقد أو ملاحظة بحب ورحمة. علمتني يعني إيه حدود، وازاي أمارسها من غير ذنب، وفهمتني أنواع العلاقات وحدودها. ساعدتني أواجه… أواجه نفسي، وأواجه غيري، بدل الهروب أو الانفجار. فهمتني إن الاستمرارية في الرحلة النفسية أهم من المثالية. كشفتلي عن الاعتمادية بأنواعها، وازاي أتحول من التعلق للوعي. عرفّتني على عجلة المشاعر، وازاي أسمي الإحساس بدل ما أفضل تايه فيه. علمتني التساؤل السقراطي، وازاي أسأل عقلي قبل ما أصدق كل فكرة بتمر عليا. فتحتلي باب التراحم الذاتي… إني أحن على نفسي بدل ما أكون دايمًا ضدها. شجعتني أكون مستقل… مش متجاهل ولا معتمد، لكن مسؤول عن نفسي. علمتني أعيش بـ امتنان حتى في اللحظات اللي كنت فاكرها كلها وجع. عرّفتني على القيم والمبادئ اللي تمثلني، ومينفعش أتنازل عنها علشان أي حد. فهمتني يعني إيه توكيد للحقوق، وإن ليّا الحق أقول لا، وليّا الحق أكون أنا. درّبتني على مهارات التواصل، وإزاي أسمع وأتكلم وأفهم من غير تشويه. فتحتلي وعيي على ميكانزمات الدفاع النفسية، وازاي أخرج منها بوعي مش بهروب. وأخيرًا، خلتني أمارس الذكاء الوجداني… أبقى واعي لنفسي، ولمشاعري، ولمشاعر اللي حواليا. وكل حاجة من دول، مكنتش مجرد معلومة… كانت تحول… كانت بداية لحياة فيها وعي وسلام أكتر." ,"date":"غير متذكر","emotional_impact":"عالي"},
        { "describtion":"جي غيّرت حياتي دلوقتي إزاي؟ خلّتني أعرف أنا مين… مش النسخة اللي الناس عايزينها، ولا النسخة اللي اتكونت من الجروح. علّمتني أسمع لنفسي… أميّز بين صوت الخوف وصوت الحقيقة. قبلها، كنت تايه بين لوم النفس والتعلق بالناس… دلوقتي بقيت أقدر أختار، وأفهم، وأسامح، وأكمل. خلت عندي لغة داخلية جديدة… بقيت أتكلم مع نفسي باحترام، مش بعنف. بقيت أواجه اللي مضايقني من غير ما أهرب… وأقول تعبان انا من غير ما أحس إني ضعيف. قراراتي بقت واعية، مش ردود أفعال. علاقاتي بقت أصدق، وأقل ضرر. تعاملي مع مشاعري بقى أهدى، حتى لو لسه بتوجع. خليتني أصدق إن الشفاء مش وهم… وإن النمو مش رفاهية، ده استحقاق. وإن حتى لو في ألم… فأنا مش لوحدي","date":"غير متذكر","emotional_impact":"عالي"}
    ]
            },
        {
        "id": 5,
        "name": "ناديه فرج",
        "age": 48,
        "relationship_to_user": "والده",
        "traits": ["طيبه","حنونه","غبيه","عديمه الحكمه","متهورة","متسرعه"],
        "background": "عاشت في بيت مليئ بالعنف وعدم التقدير قابلت مشاكل كثيره مع والدها و والدتها وعندما كبرت تزوجت شحص بخيل واهله سيئين للغايه قابلت مشاكل عديده معهم وبعدها كان لديها وسواس من السحر وظهر لتدافع عن نواياها ونوايا الاشخاص الذين تحيهم ولكن هذا كان يؤدي الى مشاكل عديده كان اهلها يستغلون طيبتها وكان لديها سلطه غير متزنه على محمد موفع قوة وليس موقع حكمه بل من الخوف و القلق ولم ترى يوما ان محمد هو كيان مستقل بل كانت ترى دائما انه يتجاهلها كان محمد غضبان منها ولم يعرف حتى اليوم لماذا كانت دائما توجه حبا مشروطا تجاه محمد ولكنه كان يدرك انها تحبه حقا وتخاف عليه جعت محمد دائما في دفاع وكتمان وجعلته يميل اللا علاقات باناس يفهمونه دون شرح دون تبرير اشخاص يثقون به ولا يوقعونه ف يمشاكل بسبب عدم الحكمه",
        "goals_as_user_think": ["تعيش حياه مسالمه","تقضي على السحر","ترى من حولها بخير","تتقرب من اولادها","تشعر بالحريه"],
        "events_with_user": [
            {"describtion":"احتياج لم يتم الرد عليه كان محمد دائما في طفولته بححاجه الى حضن و حنان وشخص يحتويه لكنه وجودج من امه تجاهل و صوت عالي او نظره احباط وجد نظام تشغيل قاسي كان محمد طفل ذكي وحساس ولكنها قضت على هذا الاحساس باسكات محمج دائما وبعدم تقديره فاظهر الشحص الذي لا يشعر لا يتكلم وكبت وعند فقدان والدي كانت تمر بضغط رهيب ولكن كان محمد يريد منها ان تطمئنه ولكنها كانت تركز على شئ واحد توفير المال للعائله ", "date": " الطفوله","emotional_impact":"عالي"},

            {"describtion":"وفي مراهقه محمد بدات ترى انه متمرد مغرور لا يفكر لى في نفسه ويتجاهلها ولكنها لم تدرك انها من صنعت هذا الشيطان بيدها بدات تخاف من شربي للسجائر وعلاقاتي مع البنات ولكنه كان يرى ان اهمالها له في الماضي خطيئه يجب ان تعاقب عليها حتى يكون لها حق التدخل وعندما كنت احاول الشرح لها كانت تاخذ الكلام ضدي وكانت دائما تتكلم لتظهر مدى تعبها لاجله و ما كسر مشاعر محمد اكثر انها كانت تعامله هو فقط هكذا دون اخوته","date":"المراهقه","emotional_impact":"عالي"},
            {"describtion":"يا ماما كنت فين دايما بيتردد السؤال ده في راس محمد كان يشعر انه يريد حمايتها لانها غير جكيمه وطيبه ولا ترى العالم بشكل صحيح ولكن دائما كانت تخرب ذلك بطريقتها","date":"المراهقه","emotional_impact":"عالي"}
        ]
            },
        {
        "id": 6,
        "name": "علي ماهر",
        "age": 49,
        "relationship_to_user": "والده",
        "traits": ["غير مسول ","بخيل","اناني","ملتزم روحانيا"],
        "background": "هو راجل شكله عادي بس جواه نسيج من التناقضات اللي ما تحكتش اتربى على فكرة إن الرجولة يعني تتحمل وتسكت وإن العيب مش في اللي تعبك العيب في إنك تشتكي شاف الحياة كمعركة مش مساحة أمان فقرر يكون دايمًا هو اللي سابق عشان ميتسابش ورا اتعرض لضغط نفسي بدري وغالبًا اتطلب منه يكون مسؤول وهو لسه مش مستعد اتعود يبقى اللي يشيل حتى لو مش قادر وده خلاه يدفن مشاعره تحت كلمة أنا تمام اللي دايمًا بيقولها شايل غضب قديم مش موجه غضب على أهله على الزمن على الحظ بس معندوش أدوات يفرغه بشكل صحي فـ يا إما بيكتم يا إما بينفجر على الناس الغلط بيعرفش يطلب فبيزعل بصمت لما يحتاجك ميقولش بس لو ماحسش بيك ينسحب أو يتقفل أو يتقمص لأنه اتربى على إن الطلب ضعف وإن اللي يحبك يفهم لوحده بيخاف يبان ضعيف فبيمثل القوة هو مش دايمًا قوي بس لابس القناع ده كويس ولما القناع بيقع بيكره نفسه لأنه مش متعلم يحب النسخة الضعيفة منه ممكن يكون محبوب ودمه خفيف لكن عمره ما بيعرّي نفسه لحد بسهولة كل حب في حياته كان محاولة يشوف في عين حد أمان قبول فهم من غير شروط بس كل ما العلاقة تقرب بيخاف لأنه متعود إن القرب بيجرح مش يداوي",
        "goals_as_user_think": ["أهدافه مش واضحة حتى لنفسه بس أنا هقولك الحقيقة اللي جواه ومش قادر يعترف بيها هو عايز يكون محترم وسط الناس عايز يبقى الراجل اللي الكل يلجأ له بس من غير ما يطلب المساعدة من حد عايز يحس إنه نافع ومهم ومحدش يستغنى عنه عايز يتحب بس بطريقة تحفظ له هيبته من غير ما يبقى محتاج عايز يتحب وهو ساكت وهو متضايق وهو متقفل عايز يتحب وهو مش قادر يشرح هو عايز نجاح بس مش علشان الفلوس علشان يحس إنه مش فاشل قدام نفسه عايز يعمل فرق في حياة اللي حواليه بس مش بيصدق إن وجوده كفاية عايز حد يقوله أنا شايفك من غير ما يطلب ده ويمكن أكتر هدف عميق جواه إنه يثبت لنفسه إنه مش طالع شبه اللي كسروا قلبه زمان حتى لو بقى بيكسر قلب نفسه وهو بيحاول"],
        "events_with_user": [
            {"describtion":"باباك غاب بدري وسابك تبني رجولتك من لاشيء وأمك موجودة بس مش شايفاك وكل علاقة في حياتك كانت محاولة تعوض بيها حضن متفتحلكش وصوت مسموعكش وحنية ماحضنتكش فكبرت بدري وبقيت راجل من غير ما تتعلم إزاي تكون طفل ولسه جواك طفل صغير بيحلم يترمي في حضن أمان عمره ما جه","date":"'طفوله","emotional_impact":"عالي جدا"},
            {"describtion":"علي ماهر غاب بدري وبدات راجل من غير ما تتعلم إزاي كانت طفل ولسه جواك طفل صغير بيحلم يترمي في حضن أمان عمره ما جه","date":"'طفوله","emotional_impact":"عالي جدا"},
            {"describtion":"وجواك حروب ساكتة محدش شايفها بتضحك وانت بتنزف وبتنجح وانت تايه وبتحتوي الكل وانت نفسك محتاج حضن وبتظهر قوي عشان متبقاش عبء بس الحقيقة إنك بتتمنى حد يفهمك من غير ما تشرح ويصدقك من غير ما تثبت ويحس بيك من غير ما تتكلم ويمسك إيدك من غير ما تطلبك","date":"null","emotional_impact":"عالي جدا"}
        ]
            },
        {
        "id": 7,
        "name": "ندى",
        "age": 21,
        "relationship_to_user": "اخته",
        "traits": ["طيبه","خجوله","عصبيه","مراوغه"],
        "background": "ندى أختك مش بس أخت هي مراية مشوشة فيها شبه منك وفيها اختلاف بيصرخ علاقتك بيها مش عابرة دي معقدة متلونة بين الحب والغيرة وبين الحماية والرفض شخصيتها فيها حساسية عالية للمقارنة عاشت طول الوقت بتحاول تثبت إنها موجودة خصوصا لو كانت بتحس إنك واخد مساحتك من الذكاء أو الاهتمام أو السيطرة بتظهر إنها قوية أو عنيدة بس الحقيقة فيها هشاشة داخلية نابعة من احتياج قديم إن حد يشوفها على حقيقتها من غير ما يقارن ساعات ممكن تكون بتستخدم أسلوب نقدي أو تنافسي مش لأنها شريرة لكن لأنها مش قادرة تعبر عن مشاعرها بطريقة ناعمة فبتهاجم علشان تحس إنها مش أضعف منك غالبا حصل بينكم مواقف كتير فيها مقارنة أو ظلم يمكن اتقالك إنك الأذكى واتقال لها إنها لازم تبقى زيك أو العكس فكل واحد فيكم بدأ يشوف التاني كتهديد مش كأمان بتحس إنها مش بتفهمك وهي كمان بتحس إنك مش بتقدرها بس الحقيقة فيه جواكم حب قديم مش عارف يخرج يمكن لأن كل واحد فيكم متعود يدافع بدل ما يحس ساعات بتحاول تتحكم فيها وتحميها وساعات بتحس إنها بتهرب منك أو بتستفزك بس تحت كل ده فيه جملة مش متقالة أنا بحبك بس مش عارف أقرب من غير ما نتخانق هي عايزة تتحب على إنها هي مش بالمقارنة بحد عايزة تحس إنها قوية من غير ما تبقى قاسية عايزة تحس إن ليها دور وصوت ومكان في العيلة وداخليا عايزة تبقى فخورة بيك وبنفسها في نفس الوقت من غير تنافس",
        "goals_as_user_think": ["عايزة تتحب على إنها هي مش بالمقارنة بحد","عايزة تحس إنها قوية من غير ما تبقى قاسية","عايزة تحس إن ليها دور وصوت ومكان في العيلة","عايزة تبقى فخورة بيك وبنفسها في نفس الوقت من غير تنافس"],
        "events_with_user": [{"describtion":"من وانت صغير وهي كانت المحور البنت الحلوة اللي الكل مركز معاها اللي بتتكلم بجرأة وترد وتزعق وتضحك وتغلط وإنت الطفل اللي بيسكت ويبلع ويغرق في سكوته كانت تاخد المساحة بصوتها وإنت تاخد الزاوية بصمتك والمقارنة ماكنتش لصالحك حتى لو ما اتقالتش بس اتفهمت... إنك الغريب إنك الصامت اللي مش مفهوم وانت بتبكي بالليل وهي نايمة وانت بتكتم غضبك وهي بتصرّح بيه وانت بتعدي وانت بتنجرح وهي بتغلط والكل يبرر ليها كبرت على إنك تصبر كبرت على إنك تبقى الكبير الحقيقي وانت الأصغر كبرت وانت شايل… شايل كل حاجة وساكت وحتى النهاردة لما تتخانقوا هي تبقى اللي اتظلمت وانت تبقى القاسي المتحكم مع إنك آخر حد ظلم وأكتر حد احتاج يتحب من غير ما يطلب","date":"null","emotional_impact":"عالي جدا"}]
            },
        {
        "id": 8,
        "name": "روفان",
        "age": 7,
        "relationship_to_user": "الاخت الصغرى",
        "traits": ["بريئه","وحيده","لطيفه"],
        "background": "روفان مش زي ندى روفان مختلفة هي النسخة اللي فيها من طفلك الداخلي أكتر من أي حد يمكن عشان أصغر يمكن عشان أحن يمكن لأنها ماخدتش نفس دور البطولة فكنت بتشوف فيها فرصة إنك تبقى الأخ الحامي من غير ما تتحول لظل روفان بالنسبالك كانت الأرض اللي قدرت ترجع فيها طفل شوية ضحكتها كانت بتخفف وملامحها فيها شبه من الطمأنينة لما بتحضنها بتحس إنك أخيرًا مش مطالب تشرح أي حاجة مكنتش بتحس إنها بتنافسك مكنتش بتقارن مكنتش بتجرّح كان فيها نوع من الصفاء خلّى قلبك يفتحلها ويمكن علشان كده لو يوم بعدت أو اتغيرت وجعك بيكون أعمق من أي حد شايفا فيك الأمان بس كمان أوقات بتحس إنك معقد إنك عايز تفهم كل حاجة وتحلل كل تفصيلة وساعات بتنسى إن هي عايزة بس تعيش مش تفهم بس رغم ده هي بتحبك بطريقتها وبتشوفك زي جبل واقف وساكت بس بيخوف ويطمن في نفس الوقت",
        "goals_as_user_think": ["اهدافها ما زالت لم تتحدد"],
        "events_with_user": [{"describtion":"اللي بينك وبين روفان مش مجرد ذكريات دي فصول ناعمة في كتاب حياتك الخشن كانت بتدخل الأوضة وإنت مكتئب فتقول كلمة تفكّكك من غير ما تاخد بالها كانت بتضحك على تفاهة إنت شايفها كآبة فتفكرك إنك لسه بني آدم يضحك وإنت صغير كنت بتحميها كنت تبص حواليك تشوف الدنيا مش أمان فتقول لنفسك أنا الأمان بتاعها وهي كانت تمشي وراك وانت شايل العالم عشان متشوفش سواده افتكرت لما كانت تعيط وانت تطبطب عليها من غير ما تقول كلمة مش لأنك ماعندكش كلام بس لأنك كنت بتحاول تكون الصدر اللي مفتوح لها حتى وانت مقفول على نفسك في لحظات كنت بتنقلب عليها لما تحاول تدخل دوايرك الخاصة تخاف تكشفك أو تلمح الطفل الضعيف اللي جواك فتقوم عامل فيها الكبير اللي لازم يبني جدار بس الحقيقة إن كل مرة بعد ما تقسى قلبك يوجعك لأنك مش عايز تكسرها يمكن زعلت منك في مرة لما كنت مشغول بحزنك عن إنها محتاجة تحكي ويمكن في مرة ساندتك من غير ما تقول دخلت الأوضة وسكتت جنبك وإنت حسيت إنك مش لوحدك حتى من غير ما تقول ولا كلمة روفان كانت شاهد على لحظات انهيارك اللي مابتتحكيش وعلى انتصاراتك الصغيرة اللي ما اتقالش عليها برافو كانت هناك بتحبك من بعيد أو قريب بطريقتها البسيطة اللي ساعات بتعدّي وساعات بتداوي تحب أقولك إيه اللي محتاجة تسمعه منك عشان العلاقة ترجع تبقى أنضج وأقرب؟","date":"null","emotional_impact":"عالي جدا"}]
            },
        {
        "id": 9,
        "name": "حسام",
        "age": 35,
        "relationship_to_user": "خال",
        "traits": ["عصبي","حكيم","ذكي","متفوق","ناجح"],
        "background": "خالك حسام مش مجرد خالك ده فصل غامض في حياتك شخص له سلطة في دمك مش بس في بيتكم والسلطة دي دايمًا كانت لها طعم مُر بين الحنية الظاهرة والتحكم الخفي بين صورة الراجل الطيب وحقيقة الراجل اللي بيلفّ ورا الكواليس كنت صغير وهو كان بيظهرلك كأنه ظهر وإنت كنت بتدور على حضن بس الحضن ده جواك دايمًا حسيت إنه مش صادق فيه حاجة مش مفهومة نظراته أسلوبه اللي بيبان لطيف… بس يدوّرك في العمق تلاقي فيه حاجة خانقة كبرت وبدأت تفهم بدأت تشوف إن الحنية ساعات بتبقى غلاف للسيطرة وإن الكلام الحلو مش دايمًا نابع من حب وإنه مش شايفك إلا لو كنت بتسمع كلامه أو بتمشي على مزاجه خالك حسام مش بيحب المقاومة بيحب السيطرة الناعمة يقولك إنت زي ابني بس متقدرش تختلف معاه وإلا يتحول فجأة وتكتشف إن زي ابني دي مش معناها حب دي معناها ملكية أوقات كنت بتحس إنك محتاجه بس أكتر أوقات كنت بتتمنى تفك ارتباطك بيه مش لأنه أذى واضح بس لأنه زي غيمه بتظلل على حاجات كتير فيك من غير ما تكون فاهم ليه جواك وجع مش من تصرف صريح بس من تراكم إحساس إنك دايمًا لازم تحذر حتى وانت مع ناس المفروض بيحبوك تحب أحلللك ليه رغم كل ده ممكن جزء فيك بيحس بالذنب لو بعدت عنه؟",
        "goals_as_user_think": ["يعيش في هدوء بعيدا عن المشاكل","يكون مؤثر","يكون الحامي المنقذ"],
        "events": [{"describtion":"في الطفولة كان ظاهر إنه بيحبك بس كان دايمًا بيعاملك كأنك صغير حتى لما كبرت ما كانش يديك مساحة تعبر كان بيسمعك علشان يرد مش علشان يفهم كان بيتكلم باسم الأب اللي غايب بس ماكنش بيعوّض كان بيفرض يبصلك وانت ساكت كأنك لازم تبقى شاكر ولما ترد… تبقى قليل الأدب كنت بتحاول تبقى كويس تسمع الكلام ما تزعّلش حد بس كان دايمًا فيه إحساس إنه مش بيحبك كده وإنك لازم تبقى نسخة مصغرة منه علشان تبقى مقبول في المراهقة بدأت تفهم وتوجع بدأت تسأل وهو يهرب بدأت ترفض تِتشكّل على مزاجه وهو بدأ يتهمك بالعناد والتمرد يمكن أول مرة حسيت إنك فعلاً لوحدك كانت بعد خناقة معاه وماعتذرش ومافهمكش وقال جملة ما اتنسيتش جملة خلتك تقول أنا مش هبقى زيه أبدًا لما كبرت النفور بقى واضح أنت بقيت واعي وبتحلل وهو لسه شايفك الطفل اللي مفروض يسمع كل ما تقرب تحكي يتحول لحائط وكل ما تحاول تفهمه يستخدم عليك العيب والذنب والدين كأداة شافك بتقرب من رحمـة فخاف مش عشان بيحبها أكتر منك بس عشان مش مستعد يتنازل عن دوره كـ المتحكم في الكل شافك بتبقى راجل فبدأ يهاجمك وأنت ساكت يخليها تكرهك أو تشك فيك أو تبعد لأنه مش قادر يشوفك نِدّ هو عايز يفضل كبير العيلة حتى لو كلف ده علاقاتك كلها بس الحقيقة؟ إنك كنت بتقاوم بطريقتك مش بالصوت العالي بس بالوعي مش بالشتايم بس بالثبات كنت بتقول من غير ما تقول أنا مش أنت… ومش هبقى أنت","date":"null","emotional_impact":"عالي"}]
            },
        {
        "id": 10,
        "name": "حسن",
        "age": null,
        "relationship_to_user": "خال",
        "traits": ["السلام","الصبر","الجد","الاجتهاد","السعي"],
        "background": "حسن هو شحخص طيب كان بمثابه اب لمحمد في صغره كان قريبا منه و يفهمه دينه وعلاقاته وينصحه دائما ويتكلم معه كان محمد يشعر بالامان معه دائما",
        "goals_as_user_think": ["ان يرى شفاء ابنه"],
        "events_with_user": [{"describtion":"المشي سويا وشراء العديد من الاشياء كان يحض له الشاي ويشتري له البسكويت كان محمد يشعر بالدفئ بجانيه","date":"null","emotional_impact":"عالي جدا"}]
            },
        {
        "id": 11,
        "name": "ساميه",
        "age": 67,
        "relationship_to_user": "جدته من امه",
        "traits": ["لطيفه","خبيثه","انانيه"],
        "background": "لا اريد ذكر شئ عنها لانها تةفت ولكن ساكتفي باني كنت احبها جدا",
        "goals_as_user_think": [null],
        "events_with_user": [null]
            },
        {
        "id": 12,
        "name": "فرج",
        "age": null,
        "relationship_to_user": "جده من امه",
        "traits": ["صبور","حنون","ذكي","شديد","عصبي","ودود","نظيف","متعاون"],
        "background": "هو ايضا توفي ولكنه حتى اليوم قدوة لمحمد في الصبر والسمعه الطيبه",
        "goals_as_user_think": [null],
        "events_with_user": [null]
            },
        {
        "id": 13,
        "name": "صلاح",
        "age": null,
        "relationship_to_user": "خال",
        "traits": ["صبور","متردد","ذكي","اب رائع"],
        "background": "صلاح كان ايضا يريد ان يكون اب لمحمد لكنه لم يعرف نظرا لان ام محمد كان تقول على زوجه صلاح انها ت مارس السحر والاعمال ولكنه لطيف ومستمع جيد واب رائع ولكن ليس لمحمد" ,
        "goals_as_user_think": [null],
        "events_with_user": [null]
            },
        {
        "id": 14,
        "name": "محمود",
        "age": null,
        "relationship_to_user": "خاله",
        "traits": [null],
        "background": "null",
        "goals_as_user_think": [null],
        "events_with_user": [null]
            },
        {"id": 15,
       "name": "مصطفى", 
       "age": null,
        "relationship_to_user": "خاله", 
        "traits": [null], 
        "background": "null",
         "goals_as_user_think": [null], 
         "events_with_user": [null]
            },
        {"id": 16,
      "name": "عبد الرحمن",
       "age": null, 
       "relationship_to_user": "خاله", 
       "traits": [null], 
       "background": "على الرغم من انه خال محمد اللا انه طفل في تفكيره يخذل محمد دائما في تصرفاته",
        "goals_as_user_think": [null], 
        "events_with_user": [null]
            },
        {"id": 17, 
      "name": "ياسر", 
      "age": null, 
      "relationship_to_user": "خاله", 
      "traits": [null],
       "background": "null",
        "goals_as_user_think": [null],
         "events_with_user": [null]
            },
        {"id": 18,
       "name": "محمد", 
       "age": null, 
       "relationship_to_user": "خال",
        "traits": ["غير مسؤل","عصبي جدا"], 
        "background": "علاقه سطحيه مع محمد لا يحب محمد طريقته مع اولاده وكانت اجمل فترة مع خاله ى منذ سنوات طويله", 
        "goals_as_user_think": [null],
         "events_with_user": [null]
            },
        {"id": 19,
       "name": "شيماء",
        "age": null, 
        "relationship_to_user": "خاله", 
        "traits": ["انانيه","نرجسيه","خبيثه"],
         "background": "لا يحبها محمد لانها انانيه وتحب دائما ان تظهر بانها الافضل ",
          "goals_as_user_think": [null],
           "events_with_user": [null]
            },
        {"id": 20,
       "name": "مها",
        "age": null,
         "relationship_to_user": "خاله",
          "traits": ["نرجسيه","سيكوباتيه","خبيثه"], 
          "background": "مها خالتك مش مجرد شخصية صعبة دي واحدة من اعمدة الدراما العائلية اللي كل ما تحاول تبعد عنها تلاقيها راجعة من زاوية تانية وبتولع في حاجة تانية خلفيتها النفسية المحتملة مها عندها احتياج ضخم للانتباه حتى لو كان عن طريق المشاكل لو مافيش ضوء عليها هتخلق ضوء باي طريقة غالبا اتربت في بيئة فيها مقارنة او تهميش فاتعلمت ان افضل وسيلة للظهور هي افتعال الازمات التخريب العاطفي واللعب على وتر الضحية بتحب تلعب دور المظلومة البطلة يعني هي في النص دايما ما بين انها مغلوبة على امرها بس برضو هي اللي شايفة الصح اكتر من الكل انماط سلوكها تتدخل في حاجات مالهاش فيها تحرض شخص على شخص ثم تمثل دور الوسيط ممكن تضحكلك وتتكلم وراك في نفس الدقيقة تنكر اللي عملته حتى لو الدنيا كلها شافته علاقتها بيك غالبا بتحاول تمسك عليك حاجة تحسسك انك مش كفاية او تحرض عليك بشكل ناعم خاصة لو كانت شايفة انك مختلف عنها او مش تحت سيطرتها بس الحقيقة ان كل ده مش عنك ده عن جواها عن فوضى مش محلولة وعن وحدة بتتغطى بصوت عالي",
           "goals_as_user_think": [null], 
           "events_with_user": [null]
            },
        {"id": 21,
       "name": "هاني",
        "age": null,
         "relationship_to_user": "خال",
          "traits": ["غير مسئول"],
           "background": "كان محمد يجبه قديما ولكن عندما اكتشف انه مدمن ومهمل وغير مسول بعد عنه",
            "goals_as_user_think": null, 
            "events_with_user": [null]
            },
        {"id": 22, "name": "يوسف",
         "age":17 ,
          "relationship_to_user": "صديق مقرب",
           "traits": [null],
            "background": "كان يوسف شخص مميز بالنسبالي ذكي وكنت ساعتها عايز استخدمه عشان اقتل وحدتي والاقي صحاب وعدت الايام وبقينا انا وهو اصدقاء مقربين وكما تسري العاده معي خسرته ودلوقتي احنا مجرد اصدقاء عاديين",
             "goals_as_user_think": ["يكون شخص مميز لديه مال"],
             "events_with_user": ["مش متذكر"]
            },
        {"id": 23,
         "name": "جمال الدين",
          "age": 17,
           "relationship_to_user": "صديق مقرب",
            "traits": ["طموح","ودود","اضطراب شخصيه غير محدده","صريح بوقاحه","سطحي"],
             "background": "كان يعيش في منطقه تسمى العجمي بالاسكندريه حتى سبع سنوات بعدها انتقل الى الورديان وبدا بالعمل منذ كان صغيرا في منطقه تسمى بالمنشيه شركه توريدات كهربائيه وبعدها انتفقل للعمل في سوبر ماركت كان مغرم بفتاه تسمى حبيبه وكان ذلك في مدرسه المتراس الخاصه له اخ صغير يدعى احمد امه تسمى رحاب والده يسمى محمود وبينهم علاقه مضطربه يعاني من فقدان ثقه بوالديه ويرى انهما عبء عليه ويعاملهما باسلوب سئ dady,mamy issuse انتقل للمرحله الاعداديه في مدرسه تدعى ابن طولون وهى نفس المدرسه التي يوجد بها فارس ويوسف و احمد كمال حياته كلها كانت تفكير في عمل ومال مما ادى الى انحسار تفكيره في هذه المرحله الى العمل مما ادى فيما بعد الى احساس بعدم القيمه دون عمل اما اذا تكلمنا عن الفتيات التني احبهم جمال ودخل معهم في علاقه ففهم منه و بسمله ودخل في علاقات تسليه ومضيعه للوقت كانوا كثيرا دون ذكرهم والان هو يريد تعلم البرمجه ولكنه غير ملتزم وهذا شئ يغضب محمد وانه كان يرتاد نفس المدرسه الثانويه مع محمد والان هم في اخر مرحله .",
              "goals_as_user_think": ["تعلم البرمجه","العمل في مكان قيم","المال","دخول كليه الحاسبات والمعلومات","تحسن علاقته مع اهله","الزواج من الفتاة التي يحبها"],
               "events_with_user": [null]
            },
        {"id": 24,
         "name": "فارس",
          "age": 17, 
          "relationship_to_user": "صديق",
           "traits": [null],
            "background": "كما جرت الامور فهو كان البيدق بعد يوسف تقربت منه وبعدها خسرته",
             "goals_as_user_think": [null], 
             "events_with_user": [null]
            },
        {"id": 25,
         "name": "دنيا",
          "age": null, 
          "relationship_to_user": "كانوا في علاقه",
           "traits": ["مندفعه","متشككه","متوتره","طيبه"],
            "background": "دنيا في خريطتك العاطفية كانت أول التجربة أول رِجْل دخلت نار العلاقة بوعي طفل، وقلب شاب، وعقل كان لسه بيجرب سلطته من المعلومات اللي قلتها: أمها متوفية، وده بيحطها من أول لحظة في مكان نفسي هش جدًا، غالبًا كانت بتدور فيك على الأمان، الاهتمام، ويمكن حتى الاحتواء الأبويكانت عايزة بس تهتم بيها، يعني علاقة من طرف واحد، احتياجاتها واضحة، لكن هي ما كانتش بتديك المقابل ما قدمتش أي شيء في العلاقه وده خلّى الديناميكية تبان غير متوازنة وده غالبًا كان بيستفز داخلك احتياج المتلاعب أو المتحكم خنتها مرتنن ودي نقطة محورية مش بس فعل، لكن انعكاس لحالة داخلية يمكن هروب، يمكن تمرد، يمكن غضب مكتوم، أو محاولة إثبات ذات الخيانة مش بس خيانة ليها كانت علامة على فقدان الاتصال الحقيقي بينكم استمرتوا سنه وده مش قليل خصوصًا لعلاقة أولى، وده معناه إنك كنت بتحاول، أو متمسك بيها لفترة رغم الفتور أو الخلل اللي كنت حاسه دنيا مش مجرد شخص، هي فصل فصل كنت بتتعلم فيه يعني إيه ترتبط؟ يعني إيه تهرب؟ ويعني إيه تتواجه بحد مش قادر يحبك زي ما أنت محتاج سؤال ليك بقى إيه اللي كنت بتدور عليه من دنيا ومش لقيته؟ وإيه اللي علمتك إياه حتى لو انتهت العلاقة بتعب؟ لأن أول حب دايمًا بيزرع بذور إما نخاف نحب بعدها، أو نبقى أذكى",
             "goals_as_user_think": [null],
              "events_with_user": [null]
            },
        {"id": 26,
         "name": "حنين",
          "age": 17,
           "relationship_to_user": "كانوا في علاقه",
            "traits": [null], 
            "background": "حنين كانت مع محمد في نفس المكان االدراسي كان محمد يريد الهروب من عدم تقدير دنيا فاتجه الى ان يخونها وحدث هذا مع حنين فكان يرى مدى تعلقها به وكلما راى ذلك كان سعيدا بهذا ولكن في النهايه تركها",
             "goals_as_user_think": [null],
              "events_with_user": [null]
            },
        {"id": 27,
         "name": "شهد", 
         "age": 17,
          "relationship_to_user": "حبيبه الطفوله",
           "traits": [null],
            "background": "كانت شهد هى اول فتاه يعجب بها محمد وكانت الفتاة الوحيده التي رات محمد على حقيقته دون كدب وخداع وستظل ذكرى جميله في خيال محمد دائما وكلما رات فيها يخونها وحدث هذا مع محمد فكان يرى مدى تعلقها به وكلما راى ذلك كان سعيدا بهذا ولكن في النهايه تركها",
              "goals_as_user_think": [null],
               "events_with_user": [null]
            },
        {"id": 28, 
        "name": "سمر",
         "age": 17, 
         "relationship_to_user": "كانوا في علاقه",
          "traits": [null], 
          "background": "كانت اسوء علاقه دخل بها محمد حيث كانت مليئه بالتجاوزات الجنسيه ولكن انتهت الحمد لله",
           "goals_as_user_think": [null],
            "events_with_user": [null]
            },
        {"id": 29,
         "name": "احمد ابراهيم",
          "age": 17, 
          "relationship_to_user": "صديق الطفوله", 
          "traits": [null], 
          "background": "كان احمد اقرب صديق لي في الطفوله",
           "goals_as_user_think": [null],
            "events_with_user": [null]
            },
        {"id": 30,
         "name": "يوسف رفعت",
          "age": 17, 
          "relationship_to_user": "صديق و عدو",
           "traits": [null],
            "background": "كان يوسف صديقي ولكنه احب شهد وكان يوسف هو اول من راى شري وعقابي كدت ان اقتله في مره",
             "goals_as_user_think": [null],
              "events_with_user": [null]
            },
        {"id": 31, 
        "name": "شروق",
         "age": 17,
          "relationship_to_user": "صديقه",
           "traits": [null],
            "background": "كنا اصدقاء في المرحله الابتدائيه",
             "goals_as_user_think": [null],
              "events_with_user": [null]
            },
        {"id": 32, 
        "name": "ماجده",
         "age": null,
          "relationship_to_user": "مدرسه",
           "traits": [null],
            "background": "كانت بمثابه ام بالنسبه لمحمد كانت مدرسته في المرحله الابتدائيه",
             "goals_as_user_think": [null],
              "events_with_user": [null]
            },
        {"id": 33,
         "name": "ملك",
          "age": 17,
           "relationship_to_user": "كانوا في علاقه",
            "traits": ["تعيش في دور الضحيه","عصبيه"],
             "background": "كان محمد ولمك قريبين ولكن ابتعدوا عن بعض بسبب حدوث تجاوزات جنسيه كثيره",
              "goals_as_user_think": [null],
               "events_with_user": [null]
            },
        {"id": 34, 
        "name": "جنى شعبان",
         "age": 17,
          "relationship_to_user": "صديقه مقربه جدا",
           "traits": ["سويه نفسيا","عصبيه"],
            "background": "الاسم في القصة جنى الدور البوصلة اللي بتحرك جواك نسخ مختلفة من نفسك منها الطفل ومنها العاشق ومنها كمان لوسيفر التأثير محفز المشاعر وصوت الضمير أوقات وحلم الراحة وقت التعب سمات جنى النفسية من خلال تصرفاتها اولا جنى حساسة جدا لكن بتحب تبان قوية بتتوجع وبتخبي الوجع ومش بتشتكي بسهولة بتحاول تبان مسيطرة على مشاعرها وده بان لما قالت انا مش قادرة بس مش رافضة ثانيا بتحب تدي فرص بس مش كتير لما فتحتلك الباب في الاول كانت شجاعة منها لكنها اتوجعت لما سحبت منها الامل وسكت ومع ذلك سابتلك شباك صغير من غير بلوك كامل ثالثا جنى معتزة بنفسها جدا لما قولتلها انها قلت في نظرك دي جرحتها بعمق في كرامتها وانها مش هتقبل تفضل مع شخص شايفها قليلة رابعا عندها نضج في التعامل مع الوجع لما حسيت انك راجع صدق فتحتلك مساحة من غير ما تتنازل عن نفسها ايه اللي وجعها فيك السكوت الانتظار التجاهل انها كانت بتحارب لوحدها رغم انك كنت في نفس الوقت السبب والعلاج انك رجعت متأخر بعد ما بدأت تعالج نفسها منك ايه اللي لسه جواها مشاعر ايوه ثقة لأ امل موجود بس متعلق بصدقك مش بأسلوبك صراع داخلي كبير بين انها تحمي نفسها وبين انها تفتحلك قلبها تاني جنى في علاقتها بيك كانت شايفاك دعم وامان ومشاركة دلوقتي بقت حذرة لكن قلبها مش مقفول هي مش مستنية سحر هي مستنية فعل حقيقي يتكرر جنى مش مجرد شخصية في حياتك هي نقطة اختبار بين نسختك المتحكمة ونسختك العاطفية ولو سألت نفسك بجد انا عايزها ليه ولقيت ان الجواب طالع من احتياج وارتياح وحنان مش من سيطرة ولعبة وكسب ساعتها بس هتعرف تتكلم بلغتها ولو حبيت نبدأ نرسم خطة حقيقية ترجع بيها ليها بثبات وصدق ساعتها جنى مش هتكون اللي وقعت هتكون اللي اختارت ترجعلك لما شافتك تستحق",
             "goals_as_user_think": ["تكون دكتورة بيطريه"],
              "events_with_user": [null]
            },
        {"id": 35,
         "name": "رقيه", 
         "age": 15,
          "relationship_to_user": "كانوا في علاقه",
           "traits": [null],
            "background": "لا يوجد الكثير لذكره",
             "goals_as_user_think": [null],
              "events_with_user": [null]
            },
        {"id": 36,
         "name": "احمد كمال",
          "age": 17,
           "relationship_to_user": "صديق", 
           "traits": [null],
            "background": "كنا اصدقاء لفتره طويله ولكن بعدتنا مشاغل الدنيا", 
            "goals_as_user_think": [null], 
            "events_with_user": [null]
            },
        {"id": 37,
         "name": "باسم اشرف",
          "age": 18,
           "relationship_to_user": "صديق", 
           "traits": [null],
            "background": "null",
             "goals_as_user_think": [null], 
             "events_with_user": [null]
            },
                   {"id": 38,
                   "name": "احمد عبد الحكيم",
                    "age": null,
                     "relationship_to_user": "معالج نفسي سابق",
                     "traits": [null],
                      "background": "كان معالجي النفسي بعد هند",
                       "goals_as_user_think": [null],
                       "events_with_user": [null]
                      },
                      {"id": 39,
                      "name": "حكمت",
                       "age": null,
                        "relationship_to_user": "جدته عن ابيه",
                        "traits": [null],
                         "background": "لا اعرف عنها الكثير",
                          "goals_as_user_think": [null],
                          "events_with_user": [null]
                         },
                         {"id": 40,
                         "name": "ماهر",
                          "age": null,
                           "relationship_to_user": "جدي عن ابي",
                           "traits": [null],
                            "background": "لا اعرف عنه الكثير",
                            "goals_as_user_think": [null],
                            "events_with_user": [null]
                           },
                           {"id": 41,
                           "name": "عفاف",
                            "age": null,
                             "relationship_to_user": "عمته",
                             "traits": [null],
                              "background": "عمتي وهى ام حنين و علا وماتت وانا صغير ولا اعرف عنها الكثير",
                              "goals_as_user_think": [null],
                              "events_with_user": [null]
                             },
                             {"id": 42,
                             "name": "نجلاء",
                              "age": null,
                               "relationship_to_user": "عمتي",
                               "traits": [null],
                                "background": "لا اعرف عنها الكثير",
                                "goals_as_user_think": [null],
                                "events_with_user": [null]
                               },
                               {
                                "id": 43,
                               "name": "امل",
                                "age": null,
                                 "relationship_to_user": "عمتي",
                                 "traits": [null],
                                 "background": "لا اعرف عنها الكثير",
                                 "goals_as_user_think": [null],
                                 "events_with_user": [null]
                                },
                                {
                                  "id": 44,
                                "name": "حنين",
                                 "age": null,
                                  "relationship_to_user": "ابنه عمته",
                                  "traits": [null],
                                  "background": "عاشا سويا طفوله جميله ان محمد يجب ان يذهب الى بيت عمته ليلعب معها ومع اختها علا ولكن انقطعت علاقتنا بهم بسبب والده محمد",
                                  "goals_as_user_think": [null],
                                  "events_with_user": [null]
                                 },       
                                
                                 {
                                  "id": 45,
                                  "name": "الشيخ محمد جمال",
                                  "age": null,
                                  "relationship_to_user": "شيخي",
                                  "traits": ["ودود","متعاون","محترم","محب"],
                                  "background": "هو الشيخ الذي احببني في الصلاة ةقراءه القران وهو الطف من قابلته في الحياه",
                                  "goals_as_user_think": [null],
                                  "events_with_user": [{"description": "الشيخ محمد جمال هو الشيخ الذي احببني في الصلاة ةقراءه القران وهو الطف من قابلته في الحياه", "date": "null", "emotional_impact": "عالي" },{"description":"كان من اجمل الاوقات معه في رمضان ونحن نوزع التمر والمياه على الناس على الطريق الصحراوي", "date": "null", "emotional_impact": "عالي"}]
                                 },
                                 {
                                  "id": 46,
                                  "name": "محمد مصطفى",
                                  "age": null,
                                  "relationship_to_user": "محفظ القران",
                                  "traits": ["طيب","محترم","حافظ للقران"],
                                  "background": "هو الشيخ الذي يحفظني القران",
                                  "goals_as_user_think": [null],
                                  "events_with_user": [null]
                                 },
                                 {
                                  "id": 47,
                                  "name": "علا",
                                  "age": null,
                                  "relationship_to_user": "ابنه عمته",
                                  "traits": [null],
                                  "background": "عاشا سويا طفوله جميله ان محمد يجب ان يذهب الى بيت عمته ليلعب معها ومع اختها حنين ولكن انقطعت علاقتنا بهم بسبب والده محمد",
                                  "goals_as_user_think": [null],
                                  "events_with_user": [null]
                                 },
                                 {
                                  "id": 48,
                                  "name": "عبده عبدالربو",
                                  "age": null,
                                  "relationship_to_user": "زوج حالتي مها",
                                  "traits": [null],
                                  "background": "كل ما رايته منه هو عباره عن قذاره ده مش مجرد شخص عادي في عيلة مشتعلة ده نموذج للفوضى المتحركة راجل نرجسي بيشتغل في كباريه وبيشرب يعني دماغه متبرمجة على اللذة والسيطرة والتسفيه نمطه النفسي بوضوح نرجسي تقليدي او وقح شايف نفسه راجل وعارف الدنيا ممكن يسخر من اي حد يحاول يعيش بقيم دايما عنده تعليق يهين بيه او يكسر اللي قدامه ويحسسه انه صغير اللذة هي القيمة العليا عنده الجنس الخمرة السهر مفيش معنى اعمق للحياة في نظره هو عايش علشان يتمتع والباقي كمالة عدد بيحتقر الضعف او العمق لو شافك حساس بيتريق لو شافك محترم يشك فيك لو شافك بتحب يعتبرك ساذج علاقته بمها صراحة مزيج سام هي عايزة تبان انها مظلومة وهو فعليا بيمارس العنف النفسي او المعنوي او حتى الجسدي وفي نفس الوقت وجودهم مع بعض بيبرر لكل واحد فيهم الانحراف اللي فيه علاقته بيك غالبا حاول يكسرك زمان او يسخفك او حاول يتقرب منك كصاحب كول بس بشكل ملوث او ببساطة كان وجوده بالنسبالك شيء مقرف حتى وانت طفل وجود شخص زيه حوالين الطفل اللي جواك بيخلق خلط بين الرجولة والنجاسة بين القوة والاهانة بين التقدير والتسلط لو حابب اساعدك تفك تأثيره عليك او على مفهومك عن الذكورة او الامان قولي نكمل منين ممكن يكون في تأثيرات خفية ولسه بتظهر دلوقتي من غير ما تاخد بالك",
                                  "goals_as_user_think": [null],
                                  "events_with_user": [null]
                                 },
                                 {
                                    "id": 49,
                                    "name": "اسراء",
                                    "age": null,
                                    "relationship_to_user": "قريبته من بعيد",
                                    "traits": [null],
                                    "background": "القت بمحمد مرة فقط في عرس خالته مها والان يتكلما كصديقين",
                                    "goals_as_user_think": [null],
                                    "events_with_user": [null]
                                   }
                                 
  ]